nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
						}
					else if(pstrTemp[4]=='2')	///备用域名
						{
						rt_kprintf("\r\n设置备用域名 !");
						memset(DomainNameStr_aux,0,sizeof(DomainNameStr_aux));					  
						memset(SysConf_struct.DNSR_Aux,0,sizeof(DomainNameStr_aux));
						memcpy(DomainNameStr_aux,(char*)pstrTempStart,cmdLen);
						memcpy(SysConf_struct.DNSR_Aux,(char*)pstrTempStart,cmdLen);
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_DNSR2_Set(SysConf_struct.DNSR_Aux,1);
						
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						}
					else
						{
						continue;
						}
					}
				}
			else if(strncmp(pstrTemp,"PORT",4)==0)			///2. 设置端口
				{
				j=sscanf(sms_content,"%u",&u16Temp);
				if(j)
					{
					if(pstrTemp[4]=='1')		///主端口
						{
						rt_kprintf("\r\n设置主端口=%d!",u16Temp);
						RemotePort_main=u16Temp;
						SysConf_struct.Port_main=u16Temp;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

						//------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						     SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							  DataLink_EndFlag=1; //AT_End();  

						 //--------    清除鉴权码 -------------------
					     idip("clear");		   	  

						}
					else if(pstrTemp[4]=='2')	///备用端口
						{
						rt_kprintf("\r\n设置备用端口=%d!",u16Temp);
						RemotePort_aux=u16Temp;
						SysConf_struct.Port_Aux=u16Temp;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_AuxSocket_set(RemoteIP_aux,RemotePort_aux,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						}
					else
						{
						continue;
						}
					}
				
				}
			else if(strncmp(pstrTemp,"DUR",3)==0)				///3. 修改发送间隔
				{
				j=sscanf(sms_content,"%u",&u16Temp);
				if(j)
					{
					
					rt_kprintf("\r\n修改发送间隔! %d",u16Temp);
					dur(sms_content);
					/*
					JT808Conf_struct.DURATION.Default_Dur=u16Temp;
					Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
					*/

					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);
					}
				}
			#if 0
			   else if(strncmp(pstrTemp,"DEVICEID",8)==0)			///4. 修改终端ID
				{
				if(cmdLen<=sizeof(DeviceNumberID))
					{
					rt_kprintf("\r\n修改终端ID  !");
					memset(DeviceNumberID,0,sizeof(DeviceNumberID));
					memcpy(DeviceNumberID,pstrTempStart,cmdLen);
					DF_WriteFlashSector(DF_DeviceID_offset,0,DeviceNumberID,13); 
					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					 //--------    清除鉴权码 -------------------
					     idip("clear");		     
					
					}
				else
					{
					       continue;
					}
				}    //DeviceNumberID		
			   #endif
				else if(strncmp(pstrTemp,"SIMID",5)==0)			///4. 修改SIMID
				{
				if(cmdLen<=sizeof(SimID_12D))
					{
					rt_kprintf("\r\n修改SIM_ID  !");
					memset(SimID_12D,0,sizeof(SimID_12D));
					memcpy(SimID_12D,pstrTempStart,cmdLen);
					DF_WriteFlashSector(DF_SIMID_12D,0,SimID_12D,13);  
					SIMID_Convert_SIMCODE(); //  转换
					
					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					 //--------    清除鉴权码 -------------------
					     idip("clear");		     
					
					}
				    else
					{
					       continue;
					}
				}   	
				else if(strncmp(pstrTemp,"PHONENUM",8)==0)			///4. 修改SIMID
				{
				   if(cmdLen==11)
					{
						rt_kprintf("\r\n修改PHONENUM_ID  !"); 
						memset(SimID_12D,0,sizeof(SimID_12D));
						SimID_12D[0]='0'; //    第一位填写 0  
						memcpy(SimID_12D+1,pstrTempStart,cmdLen);
						DF_WriteFlashSector(DF_SIMID_12D,0,SimID_12D,13);  
						SIMID_Convert_SIMCODE(); //  转换
						
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						 //--------    清除鉴权码 -------------------
						     idip("clear");		      
					
					}
				else
					{
					       continue;
					}
				}   
			else if(strncmp(pstrTemp,"IP",2)==0)				///5.设置IP地址
				{
				j = sscanf(sms_content, "%u.%u.%u.%u", (u32*)&u8TempBuf[0], (u32*)&u8TempBuf[1], (u32*)&u8TempBuf[2], (u32*)&u8TempBuf[3]);
				//j=str2ip(sms_content, u8TempBuf);
				if(j==4)
				 	{
				 	rt_kprintf("\r\n设置IP地址!");
					if(pstrTemp[2]=='1')
						{ 
						memcpy(SysConf_struct.IP_Main,u8TempBuf,4);
						memcpy(RemoteIP_main,u8TempBuf,4);
						SysConf_struct.Port_main=RemotePort_main;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						rt_kprintf("\r\n短信设置主服务器 IP: %d.%d.%d.%d : %d ",RemoteIP_main[0],RemoteIP_main[1],RemoteIP_main[2],RemoteIP_main[3],RemotePort_main);
						//-----------  Below add by Nathan  ----------------------------
						DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					     //------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						      SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							   DataLink_EndFlag=1;

						 //--------    清除鉴权码 -------------------
					     idip("clear");		   

						}
					else if(pstrTemp[2]=='2')
						{
						memcpy(SysConf_struct.IP_Aux,u8TempBuf,4);
						memcpy(RemoteIP_aux,u8TempBuf,4);
						SysConf_struct.Port_Aux=RemotePort_aux;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						rt_kprintf("\r\n短信设置备用服务器 IP: %d.%d.%d.%d : %d ",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_aux);   
						//-----------  Below add by Nathan  ----------------------------
						DataLink_AuxSocket_set(RemoteIP_aux,RemotePort_aux,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						}
					}
				}
			  if(strncmp(pstrTemp,"MODE",4)==0)			///6. 设置定位模式
				{
				        if(strncmp(sms_content,"BD",2)==0)
				        {
                                                 gps_mode("1");
				        }
					  if(strncmp(sms_content,"GP",2)==0)
				        {
                                                 gps_mode("2");
				        }	
					   if(strncmp(sms_content,"GN",2)==0)
				        {
                                                 gps_mode("3");  
				        }
					   Add_SMS_Ack_Content(sms_ack_data,ACKstate);
				}
			else if(strncmp(pstrTemp,"VIN",3)==0)				///7.设置车辆VIN
				{
				     vin_set(sms_content);
				    Add_SMS_Ack_Content(sms_ack_data,ACKstate);
				}
			else if(strncmp(pstrTemp,"TIREDCLEAR",10)==0)		///8.清除疲劳驾驶记录
				{
				      TiredDrv_write=0;
				      TiredDrv_read=0;	   
				      DF_Write_RecordAdd(TiredDrv_write,TiredDrv_read,TYPE_TiredDrvAdd);      
				      Add_SMS_Ack_Content(sms_ack_data,ACKstate);	   
				}
			else if(strncmp(pstrTemp,"DISCLEAR",8)==0)			///9清除里程
				{
				   	  JT808Conf_struct.DayStartDistance_32=0;
					  JT808Conf_struct.Distance_m_u32=0;
                                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
					   Add_SMS_Ack_Content(sms_ack_data,ACKstate);				 
				}
            else if(strncmp(pstrTemp,"SPDWARNCLEAR",12)==0)    //  超速报警清除
            	{
            	  
					 //-----  Record update---- 	
				     AvrgSpdPerMin_write=0;
					 AvrgSpdPerMin_write=0;
				     DF_Write_RecordAdd(AvrgSpdPerMin_write, AvrgSpdPerMin_write, TYPE_AvrgSpdAdd);  
					 Add_SMS_Ack_Content(sms_ack_data,ACKstate);	

