nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);
					}
				}
			else if(strncmp(pstrTemp,"CONNECT",6)==0)
				{
				    j=sscanf(sms_content,"%d",&u16Temp);
					if(j)
					{
						
						Vechicle_Info.Link_Frist_Mode=u16Temp;  
		        		rt_kprintf("\r\n 首次连接方式 %s ,%d \r\n",sms_content,Vechicle_Info.Link_Frist_Mode);          
						DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));		
						
						WatchDog_Feed();
						DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
						
						WatchDog_Feed();
						DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
						 //--------    清除鉴权码 -------------------
					     idip("clear");		   
					} 
				}
           else if(strncmp(pstrTemp,"CLEARREGIST",11)==0)
           	    {
                     //--------    清除鉴权码 -------------------
					     idip("clear");		
                     DEV_regist.Enable_sd=1; // set 发送注册标志位
			         DataLink_EndFlag=1; 
					 Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state
           	    }
		   //  20
	        else if(strncmp(pstrTemp,"PASSWORD",8)==0)  //设置密码通过
       	    {
                j=sscanf(sms_content,"%d",&u16Temp);
				if(j)
				{
				  Login_Menu_Flag=(u8)u16Temp;	   // clear  first flag 	 			
			      DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 
			
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state
				    if(Login_Menu_Flag)
				    	{
				    	  //--------    清除鉴权码 -------------------
					      idip("clear");
						  DEV_regist.Enable_sd=1; // set 发送注册标志位
			              DataLink_EndFlag=1; 
				    	}
				} 
       	    } 
			else if(strncmp(pstrTemp,"RECOVER",7)==0)
				{
                     //------  界面回复出厂设置
					 Login_Menu_Flag=0;	  // clear	first flag		 
					 DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 

					 Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state                  
                     Systerm_Reset_counter=Max_SystemCounter-30; //返回短信后恢复出厂设置
					 
				} //provinceid
			else if(strncmp(pstrTemp,"PROVINCEID",10)==0)
			{
                  provinceid(sms_content);
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate);
				 
			}	
			else if(strncmp(pstrTemp,"CITYID",6)==0)
			{
                  cityid(sms_content); 
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate); 
				 
			}
			else												
			{
				;
				}
			//---------------------------------------------------------------
			}
		else
			{
			break;
			}
		}
}



/*********************************************************************************
*函数名称:u8 SMS_Rx_Text(char *instr,char *strDestNum)
*功能描述:接收到TEXT格式的短信处理函数
*输    入:instr 原始短信数据，strDestNum接收到得信息的发送方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Text(char *instr,char *strDestNum)
{
	u16 len;
	u8 ret=0;
	len=strlen(strDestNum);
	memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
	if(len>sizeof( SMS_Service.SMS_destNum ))
		{
		len=sizeof( SMS_Service.SMS_destNum );
		}
	memcpy(SMS_Service.SMS_destNum,strDestNum,len);
	rt_kprintf( "\r\n  短息来源号码:%s", SMS_Service.SMS_destNum );
	
	len=strlen(instr);
	rt_kprintf( "\r\n 短信收到消息: " );
	rt_device_write( &dev_vuart, 0, instr, len);
	
	if( strncmp( (char*)instr, "TW703#", 6 ) == 0 )                                                //短信修改UDP的IP和端口
	{
		//-----------  自定义 短息设置修改 协议 ----------------------------------
		SMS_protocol( instr + 5, len - 5 ,SMS_ACK_msg);
		ret=1;
	}
	SMS_Service.SMS_read		= 0;
	SMS_Service.SMS_waitCounter = 0;
	SMS_Service.SMS_come		= 0;
	//SMS_Service.SMS_delALL		= 1;
	return ret;
}


u8 SMS_Rx_PDU(char *instr,u16 len)
{
	char *pstrTemp;
	u8 ret=0;
	u16 content_len=0;
	
	//////
	memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
	pstrTemp=(char *)rt_malloc(200);	///短信解码后的完整内容，解码后汉子为GB码
	memset(pstrTemp,0,200);
	rt_kprintf( "\r\n 短信原始消息: " );
	rt_device_write( &dev_vuart, 0, GSM_rx, len );

	#ifdef MC8332_CDMA

        content_len=CDMA_decode_PDU(GSM_rx,len-3,SMS_Service.SMS_destNum,pstrTemp); //-1 因为有一个->
        len=content_len; 
    #endif 
		
	rt_kprintf( "\r\n  短息来源号码:%s \r\n", SMS_Service.SMS_destNum );
	rt_kprintf( "\r\n 短信消息: " ); 
	rt_device_write( &dev_vuart, 0, pstrTemp, len );
	//rt_hw_console_output(GSM_rx);
	if( strncmp( (char*)pstrTemp, "TW703#", 6 ) == 0 )                                                //短信修改UDP的IP和端口
	{
		//-----------  自定义 短息设置修改 协议 ----------------------------------
		SMS_protocol( pstrTemp + 5, len - 5 ,SMS_ACK_msg);
		ret=1;
	}
	SMS_Service.SMS_read		= 0;
	SMS_Service.SMS_waitCounter = 3;
	SMS_Service.SMS_come		= 1;
	//SMS_Service.SMS_delALL		= 1;
	rt_free( pstrTemp );
	pstrTemp = RT_NULL;
	//////
	return ret;
}




/*********************************************************************************
*函数名称:u8 SMS_Tx_Text(char *strDestNum,char *s)
*功能描述:发送TEXT格式的短信函数
*输    入:s 原始短信数据，strDestNum接收方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Tx_Text(char *strDestNum,char *s) 
{
	u16 len;
	char *pstrTemp;
	
	memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
	strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=\"" ); 
	//strcat(SMS_Service.SMSAtSend,"8613820554863");// Debug
	strcat(SMS_Service.SMSAtSend,strDestNum);
	strcat(SMS_Service.SMSAtSend,"\"\r\n");

	rt_kprintf("\r\n%s",SMS_Service.SMSAtSend); 
	rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );

	rt_thread_delay(50);
	
	pstrTemp=rt_malloc(150);
	memset(pstrTemp,0,150);
	len=strlen(s);
	memcpy(pstrTemp,s,len);
	pstrTemp[len++]=0x1A;      // message  end  

	///发送调试信息
	rt_device_write( &dev_vuart, 0, pstrTemp, len);
	///发送到GSM模块
	rt_hw_gsm_output_Data(pstrTemp, len); 
	rt_free( pstrTemp );
	pstrTemp=RT_NULL; 
	return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_Text, SMS_Tx_Text);



/*********************************************************************************
*函数名称:u8 SMS_Tx_PDU(char *strDestNum,char *s)
*功能描述:发送PDU格式的短信函数
*输    入:s 原始短信数据，strDestNum接收方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Tx_PDU(char *strDestNum,char *s)
{
	u16 len;
	u16 i;
	char *pstrTemp;
	memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
	pstrTemp=rt_malloc(400);
	memset(pstrTemp,0,400);
	i=0;
	SetPhoneNumToPDU(SMS_Service.Sms_Info.TPA, strDestNum, sizeof(SMS_Service.Sms_Info.TPA));
	len=AnySmsEncode_NoCenter(SMS_Service.Sms_Info.TPA,GSM_UCS2,s,strlen(s),pstrTemp);
	//len=strlen(pstrTemp);
	pstrTemp[len++]=0x1A;      // message  end  	
	//////
	sprintf( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=%d\r\n", (len-2)/2); 
	rt_kprintf("%s",SMS_Service.SMSAtSend); 
	rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
	rt_thread_delay(50);
	//////	
	rt_device_write( &dev_vuart, 0, pstrTemp, strlen(pstrTemp) );
	//rt_hw_console_output(pstrTemp);
	rt_hw_gsm_output_Data(pstrTemp, len); 
	rt_free( pstrTemp );
	pstrTemp=RT_NULL;
	return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_PDU, SMS_Tx_PDU);


/*********************************************************************************
*函数名称:u8 SMS_Rx_Notice(u16 indexNum)
*功能描述:模块收到新短信通知
*输    入:新短信的索引号
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Notice(u16 indexNum)
{
	SMS_Service.SMIndex=indexNum;
	rt_kprintf( " index=%d", SMS_Service.SMIndex );
	SMS_Service.SMS_read		= 3;
	SMS_Service.SMS_waitCounter = 1;
	return 1;
}


///测试函数，测试SMS短信接收处理命令解析的正确性
void SMS_Test(char * s)
{
	SMS_protocol(s,strlen(s),SMS_ACK_none);
}
//FINSH_FUNCTION_EXPORT(SMS_Test, SMS_Test);

///测试函数，测试PDU数据包的接收解析功能
void SMS_PDU(char *s)
{
	u16 len;
	char *pstrTemp;
	pstrTemp=(char *)rt_malloc(160);	///短信解码后的完整内容，解码后汉子为GB码
	len=GsmDecodePdu(s,strlen(s),&SMS_Service.Sms_Info,pstrTemp);
	GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.SCA, sizeof(SMS_Service.Sms_Info.SCA));
	rt_kprintf( "\r\n  短息中心号码:%s \r\n", SMS_Service.SMS_destNum );
	GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.TPA, sizeof(SMS_Service.Sms_Info.TPA));
	rt_kprintf( "\r\n  短息来源号码:%s \r\n", SMS_Service.SMS_destNum );
	rt_kprintf( "\r\n 短信消息:\"%s\"\r\n",pstrTemp);
	rt_free( pstrTemp );
	pstrTemp = RT_NULL;
}
//FINSH_FUNCTION_EXPORT(SMS_PDU, SMS_PDU);
